In [2]:
#Q1:
import pandas as pd

# a simple list
list = ['4', '8', '15', '16', '23','42']

# create series form a list
ser = pd.Series(list)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: object

In [8]:
#Q2:
import pandas as pd
l=[1,2,3,4,5,6,7,8,9,0]
s= pd.Series(l)
print(s)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

In [16]:
#q3:
import pandas as pd

In [14]:
df=pd.read_excel("table_assignment.xlsx")

In [15]:
df

     Name  Age   Gender
0   Alice    25  Female
1     bob    30    Male
2  Claire    27  Female

#Q4:
Pandas Series	Pandas DataFrame
One-dimensional	Two-dimensional
Homogenous – Series elements must be of the same data type.	Heterogenous – DataFrame elements can have different data types.
Size-immutable – Once created, the size of a Series object cannot be changed.	Size-mutable – Elements can be dropped or added in an existing DataFrame.

#Q5: 
Functions:
read
columns
tail
head
shape , size , info 
insa
Describe
Nunique
Value Counts
columns

In [17]:
df.columns

Index(['Name', 'Age ', 'Gender'], dtype='object')

In [1]:
#Q6:

import pandas as pd
# Create pandas Series
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000